Revit 2027 API
LineLightShape(LineLightShape) Constructor
 Creates a copy of the given line light shape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LineLightShape(
	LineLightShape other
)
Public Sub New (
	other As LineLightShape
)
public:
LineLightShape(
	LineLightShape^ other
)
new :
        other : LineLightShape -> LineLightShape
Parameters
other LineLightShape
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LineLightShape Class
LineLightShape Overload
Autodesk.Revit.DB.Lighting Namespace